taskt/Core/Automation/Commands/FileGroup/IFileExistsFilePathPathResultProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IFileExistsFilePathPathResultProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands" [ label="AFileExistsFilePathPathResultCommands", style="dashed", ];
"taskt.Core.Automation.Commands.IFileExistsFilePathPathResultProperties" [ label="IFileExistsFilePathPathResultProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.OpenFileCommand" [ label="OpenFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetFileInformationCommand" [ label="GetFileInformationCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CheckFileExistsCommand" [ label="CheckFileExistsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.DeleteFileCommand" [ label="DeleteFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.WaitForFileToExistCommand" [ label="WaitForFileToExistCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands" -> "taskt.Core.Automation.Commands.IFileExistsFilePathPathResultProperties";
"taskt.Core.Automation.Commands.OpenFileCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
"taskt.Core.Automation.Commands.GetFileInformationCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
"taskt.Core.Automation.Commands.CheckFileExistsCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
"taskt.Core.Automation.Commands.DeleteFileCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
"taskt.Core.Automation.Commands.WaitForFileToExistCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
}
